<a href="https://colab.research.google.com/github/Ganesh9100/pandas-/blob/master/pandas_part03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd 
df=pd.read_csv('https://bit.ly/drinksbycountry')

In [2]:
df.tail()

       country  beer_servings  ...  total_litres_of_pure_alcohol      continent
188  Venezuela            333  ...                           7.7  South America
189    Vietnam            111  ...                           2.0           Asia
190      Yemen              6  ...                           0.1           Asia
191     Zambia             32  ...                           2.5         Africa
192   Zimbabwe             64  ...                           4.7         Africa

[5 rows x 6 columns]

In [3]:
df.shape

(193, 6)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [5]:

# memory usage why that plus 
# bcz obj are ref to other obj so , its atleast 10.6kb may be more

In [6]:
# true memory usage 
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [7]:
# how much each series uses 
df.memory_usage(deep=True)           # 1544 bytes

Index                             128
country                         12588
beer_servings                    1544
spirit_servings                  1544
wine_servings                    1544
total_litres_of_pure_alcohol     1544
continent                       12332
dtype: int64

In [8]:
# how much each series uses 
df.memory_usage(deep=True).sum()

31224

In [9]:
# object column will take more space 
# so how do i reduce it 
#what if we store our strings as integers

In [10]:
# above we have continent as 7 different but only 7 unique is taken up to many rows so taking more memory 
# lets try to manage it as category  to reduce some space

In [11]:
sorted(df.continent.unique(),reverse=False) # sorted(reverse=False by default )

['Africa', 'Asia', 'Europe', 'North America', 'Oceania', 'South America']

In [12]:
# 0 to africa 
# 1 to asia 
#.....6 to South america

Changing the continent type as category

In [13]:
df['continent'] = df.continent.astype('category')

In [14]:
df.dtypes

country                           object
beer_servings                      int64
spirit_servings                    int64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    category
dtypes: category(1), float64(1), int64(3), object(1)
memory usage: 8.1+ KB

**IT WILL SHOW THE SAME AFRICA ASIA ... IN DATA FRAME BUT BACKSIDE IT IS STORED AS CATEGORY**

In [16]:
df.continent.head()

0      Asia
1    Europe
2    Africa
3    Europe
4    Africa
Name: continent, dtype: category
Categories (6, object): [Africa, Asia, Europe, North America, Oceania, South America]

**so below are the codes to the string**

In [17]:
df.continent.cat.codes.head() # cat - means . like eg string for str , cat - category type , codes self explainatory

0    1
1    2
2    0
3    2
4    0
dtype: int8

In [18]:
df.memory_usage(deep=True)

Index                             128
country                         12588
beer_servings                    1544
spirit_servings                  1544
wine_servings                    1544
total_litres_of_pure_alcohol     1544
continent                         744
dtype: int64

In [19]:
# before continent as object type , it showed 122334 bytes but now reduced to 744

In [20]:
# lets try for country 

df['country'] = df.country.astype('category')

In [21]:
df.country.head()

0    Afghanistan
1        Albania
2        Algeria
3        Andorra
4         Angola
Name: country, dtype: category
Categories (193, object): [Afghanistan, Albania, Algeria, Andorra, ..., Vietnam, Yemen, Zambia, Zimbabwe]

In [32]:
# so there are 5 unique objects 
#df.country.unique()

[Afghanistan, Albania, Algeria, Andorra, Angola, NaN]
Categories (5, object): [Afghanistan, Albania, Algeria, Andorra, Angola]

In [22]:
df.country.cat.codes.head(10) # for nan values it is taken as -1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int16

In [23]:
# now lets look up the memory usage 
df.memory_usage(deep=True)

Index                             128
country                         18094
beer_servings                    1544
spirit_servings                  1544
wine_servings                    1544
total_litres_of_pure_alcohol     1544
continent                         744
dtype: int64

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    category
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    category
dtypes: category(2), float64(1), int64(3)
memory usage: 13.4 KB

In [25]:
# here u can see the obkjcet colum country has changed to category and has raised the memory usage cz we have 193 objects that matched to integer 
# thats y 
# so use the category form only when u have obj type with very unique labels

In [35]:
df.country.cat.codes

0        0
1        1
2        2
3        3
4        4
      ...
188    188
189    189
190    190
191    191
192    192
Length: 193, dtype: int16

In [36]:
df.country.cat.categories

Index(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria',
       ...
       'United Arab Emirates', 'United Kingdom', 'Uruguay', 'Uzbekistan',
       'Vanuatu', 'Venezuela', 'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype='object', length=193)

In [1]:
# creating the data frame 
import pandas as pd 
dff=pd.DataFrame({'id':[100,101,102,103,104],'quality':['good','very_good','amazing','awesome','poor']}) # in set , keys are the column heading

In [2]:
dff

    id    quality
0  100       good
1  101  very_good
2  102    amazing
3  103    awesome
4  104       poor

**NOW WE ARE GOINT TO CATEGORIES THE COLUMN QUANTITY WITH SOME CUSTOME ORDER LIKE VERY GOOD RANKED 0 POOR IS RANKED 4 LIKE THAT**

In [4]:
# sorting based on the quality 
dff.sort_values('quality') # BUT BY DEFAULT IT IS SORTED BASED ON THE ALPHABET BUT WE WANT SOME LOGIC AS VERY_GOOD IS AS RANK 1

    id    quality
2  102    amazing
3  103    awesome
0  100       good
4  104       poor
1  101  very_good

In [5]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       5 non-null      int64
 1   quality  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [6]:
from pandas.api.types import CategoricalDtype

In [7]:
tty=CategoricalDtype(categories =['very_good','amazing','awesome','good','poor'],ordered=True)
dff['quality'] = dff.quality.astype(tty)

# I HAE CREATED A LOGIC AS 
""" VERY GOOD AS 0 TH RANK 
AMAZING AS 2ND RANK 
POOR HAS 4TH RANK """

In [8]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       5 non-null      int64
 1   quality  5 non-null      category
dtypes: category(1), int64(1)
memory usage: 373.0 bytes

In [9]:
dff

    id    quality
0  100       good
1  101  very_good
2  102    amazing
3  103    awesome
4  104       poor

In [10]:
dff.sort_values('quality')

    id    quality
1  101  very_good
2  102    amazing
3  103    awesome
0  100       good
4  104       poor

In [11]:
dff.loc[dff.quality < 'poor',:] #   dff.loc[row,column]  selec the rows where quality is < poor and select all column

    id    quality
0  100       good
1  101  very_good
2  102    amazing
3  103    awesome